app/controllers/school_classes_controller.rb

  def update
    @school_class = find_school_class
    @school_class.update(school_class_params(:title, :room_number))
---
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 222], ["updated_at", "2020-02-24 19:41:48.959393"], ["id", 1]]

    def find_school_class
      @school_class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]